bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32G0B1.svd
        <register>
          <name>ISR_FIFO_ENABLED</name>
          <displayName>ISR_FIFO_ENABLED</displayName>
          <description>Interrupt &amp; status
          register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x008000C0</resetValue>
          <fields>
		   <field>
            <name>PE</name>
            <description>Parity error
This bit is set by hardware when a parity error occurs in receiver mode. It is cleared by software, writing 1 to the PECF in the USART_ICR register.
An interrupt is generated if PEIE = 1 in the USART_CR1 register.
Note: This error is associated with the character in the USART_RDR.</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>No parity error</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>Parity error</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>FE</name>
            <description>Framing error
This bit is set by hardware when a de-synchronization, excessive noise or a break character is detected. It is cleared by software, writing 1 to the FECF bit in the USART_ICR register.
When transmitting data in Smartcard mode, this bit is set when the maximum number of transmit attempts is reached without success (the card NACKs the data frame).
An interrupt is generated if EIEÂ =Â 1 in the USART_CR1 register.
Note: This error is associated with the character in the USART_RDR.</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>No Framing error is detected</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>Framing error or break character is detected</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>NE</name>
            <description>Noise detection flag
This bit is set by hardware when noise is detected on a received frame. It is cleared by software, writing 1 to the NECF bit in the USART_ICR register.
Note: This bit does not generate an interrupt as it appears at the same time as the RXFNE bit which itself generates an interrupt. An interrupt is generated when the NE flag is set during multi buffer communication if the EIE bit is set.
When the line is noise-free, the NE flag can be disabled by programming the ONEBIT bit to 1 to increase the USART tolerance to deviations (Refer to Tolerance of the USART receiver to clock deviation on pageÂ 861).
This error is associated with the character in the USART_RDR.</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>No noise is detected</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>Noise is detected</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>ORE</name>
            <description>Overrun error
This bit is set by hardware when the data currently being received in the shift register is
ready to be transferred into the USART_RDR register while RXFF = 1. It is cleared by a software, writing 1 to the ORECF, in the USART_ICR register.
An interrupt is generated if RXFNEIEÂ =Â 1 or EIE = 1 in the USART_CR1 register.
Note: When this bit is set, the USART_RDR register content is not lost but the shift register is overwritten. An interrupt is generated if the ORE flag is set during multi buffer communication if the EIE bit is set.
This bit is permanently forced to 0 (no overrun detection) when the bit OVRDIS is set in the USART_CR3 register.</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>No overrun error</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>Overrun error is detected</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>IDLE</name>
            <description>Idle line detected
This bit is set by hardware when an Idle Line is detected. An interrupt is generated if IDLEIEÂ =Â 1 in the USART_CR1 register. It is cleared by software, writing 1 to the IDLECF in the USART_ICR register.
Note: The IDLE bit is not set again until the RXFNE bit has been set (i.e. a new idle line occurs).
If Mute mode is enabled (MMEÂ =Â 1), IDLE is set if the USART is not mute (RWUÂ =Â 0), whatever the Mute mode selected by the WAKE bit. If RWUÂ =Â 1, IDLE is not set.</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>No Idle line is detected</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>Idle line is detected</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>RXFNE</name>
            <description>RXFIFO not empty
RXFNE bit is set by hardware when the RXFIFO is not empty, meaning that data can be read from the USART_RDR register. Every read operation from the USART_RDR frees a location in the RXFIFO.
RXFNE is cleared when the RXFIFO is empty. The RXFNE flag can also be cleared by writing 1 to the RXFRQ in the USART_RQR register.
An interrupt is generated if RXFNEIEÂ =Â 1 in the USART_CR1 register.</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>Data is not received</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>Received data is ready to be read.</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>TC</name>
            <description>Transmission complete
This bit indicates that the last data written in the USART_TDR has been transmitted out of the shift register.
It is set by hardware when the transmission of a frame containing data is complete and when TXFE is set.
An interrupt is generated if TCIEÂ =Â 1 in the USART_CR1 register.
TC bit is is cleared by software, by writing 1 to the TCCF in the USART_ICR register or by a write to the USART_TDR register.
Note: If TE bit is reset and no transmission is on going, the TC bit is immediately set.</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>Transmission is not complete</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>Transmission is complete</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>TXFNF</name>
            <description>TXFIFO not full
TXFNF is set by hardware when TXFIFO is not full meaning that data can be written in the USART_TDR. Every write operation to the USART_TDR places the data in the TXFIFO. This flag remains set until the TXFIFO is full. When the TXFIFO is full, this flag is cleared indicating that data can not be written into the USART_TDR.
An interrupt is generated if the TXFNFIE bit =1 in the USART_CR1 register.
Note: The TXFNF is kept reset during the flush request until TXFIFO is empty. After sending the flush request (by setting TXFRQ bit), the flag TXFNF should be checked prior to writing in TXFIFO (TXFNF and TXFE are set at the same time).
This bit is used during single buffer transmission.</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>Transmit FIFO is full</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>Transmit FIFO is not full</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>LBDF</name>
            <description>LIN break detection flag
This bit is set by hardware when the LIN break is detected. It is cleared by software, by writing 1 to the LBDCF in the USART_ICR.
An interrupt is generated if LBDIE = 1 in the USART_CR2 register.
Note: If the USART does not support LIN mode, this bit is reserved and kept at reset value. Refer to .</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>LIN Break not detected</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>LIN break detected</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>CTSIF</name>
            <description>CTS interrupt flag
This bit is set by hardware when the nCTS input toggles, if the CTSE bit is set. It is cleared by software, by writing 1 to the CTSCF bit in the USART_ICR register.
An interrupt is generated if CTSIEÂ =Â 1 in the USART_CR3 register.
Note: If the hardware flow control feature is not supported, this bit is reserved and kept at reset value.</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>No change occurred on the nCTS status line</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>A change occurred on the nCTS status line</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>CTS</name>
            <description>CTS flag
This bit is set/reset by hardware. It is an inverted copy of the status of the nCTS input pin.
Note: If the hardware flow control feature is not supported, this bit is reserved and kept at reset value.</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>nCTS line set</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>nCTS line reset</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>RTOF</name>
            <description>Receiver timeout
This bit is set by hardware when the timeout value, programmed in the RTOR register has lapsed, without any communication. It is cleared by software, writing 1 to the RTOCF bit in the USART_ICR register.
An interrupt is generated if RTOIEÂ =Â 1 in the USART_CR2 register.
In Smartcard mode, the timeout corresponds to the CWT or BWT timings.
Note: If a time equal to the value programmed in RTOR register separates 2 characters, RTOF is not set. If this time exceeds this value + 2 sample times (2/16 or 2/8, depending on the oversampling method), RTOF flag is set.
The counter counts even if RE = 0 but RTOF is set only when RE = 1. If the timeout has already elapsed when RE is set, then RTOF is set.
If the USART does not support the Receiver timeout feature, this bit is reserved and kept at reset value.</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>Timeout value not reached</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>Timeout value reached without any data reception</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>EOBF</name>
            <description>End of block flag
This bit is set by hardware when a complete block has been received (for example TÂ =Â 1 Smartcard mode). The detection is done when the number of received bytes (from the start of the block, including the prologue) is equal or greater than BLEN + 4.
An interrupt is generated if the EOBIEÂ =Â 1 in the USART_CR2 register.
It is cleared by software, writing 1 to the EOBCF in the USART_ICR register.
Note: If Smartcard mode is not supported, this bit is reserved and kept at reset value. Refer to .</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>End of Block not reached</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>End of Block (number of characters) reached</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>UDR</name>
            <description>SPI slave underrun error flag
In slave transmission mode, this flag is set when the first clock pulse for data transmission appears while the software has not yet loaded any value into USART_TDR. This flag is reset by setting UDRCF bit in the USART_ICR register.
Note: If the USART does not support the SPI slave mode, this bit is reserved and kept at reset value. Refer to .</description>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>No underrun error</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>underrun error</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>ABRE</name>
            <description>Auto baud rate error
This bit is set by hardware if the baud rate measurement failed (baud rate out of range or character comparison failed)
It is cleared by software, by writing 1 to the ABRRQ bit in the USART_CR3 register.
Note: If the USART does not support the auto baud rate feature, this bit is reserved and kept at reset value.</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>ABRF</name>
            <description>Auto baud rate flag
This bit is set by hardware when the automatic baud rate has been set (RXFNE is also set, generating an interrupt if RXFNEIE = 1) or when the auto baud rate operation was completed without success (ABREÂ =Â 1) (ABRE, RXFNE and FE are also set in this case)
It is cleared by software, in order to request a new auto baud rate detection, by writing 1 to the ABRRQ in the USART_RQR register.
Note: If the USART does not support the auto baud rate feature, this bit is reserved and kept at reset value.</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>BUSY</name>
            <description>Busy flag
This bit is set and reset by hardware. It is active when a communication is ongoing on the RX line (successful start bit detected). It is reset at the end of the reception (successful or not).</description>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>USART is idle (no reception)</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>Reception on going</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>CMF</name>
            <description>Character match flag
This bit is set by hardware, when a the character defined by ADD[7:0] is received. It is cleared by software, writing 1 to the CMCF in the USART_ICR register.
An interrupt is generated if CMIEÂ =Â 1in the USART_CR1 register.</description>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>No Character match detected</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>Character Match detected</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>SBKF</name>
            <description>Send break flag
This bit indicates that a send break character was requested. It is set by software, by writing 1 to the SBKRQ bit in the USART_CR3 register. It is automatically reset by hardware during the stop bit of break transmission.</description>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>Break character transmitted</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>Break character requested by setting SBKRQ bit in USART_RQR register</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>RWU</name>
            <description>Receiver wakeup from Mute mode
This bit indicates if the USART is in Mute mode. It is cleared/set by hardware when a wakeup/mute sequence is recognized. The Mute mode control sequence (address or IDLE) is selected by the WAKE bit in the USART_CR1 register.
When wakeup on IDLE mode is selected, this bit can only be set by software, writing 1 to the MMRQ bit in the USART_RQR register.
Note: If the USART does not support the wakeup from Stop feature, this bit is reserved and kept at reset value. Refer to .</description>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <enumeratedValues>
              <enumeratedValue>
                <name>B_0x0</name>
                <description>Receiver in active mode</description>
                <value>0x0</value>
              </enumeratedValue>
              <enumeratedValue>
                <name>B_0x1</name>
                <description>Receiver in Mute mode</description>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
          </field>
          <field>
            <name>WUF</name>
            <description>Wakeup from low-power mode flag
This bit is set by hardware, when a wakeup event is detected. The event is defined by the WUS bitfield. It is cleared by software, writing a 1 to the WUCF in the USART_ICR register.
An interrupt is generated if WUFIEÂ =Â 1 in the USART_CR3 register.
Note: When UESM is cleared, WUF flag is also cleared.
If the USART does not support the wakeup from Stop feature, this bit is reserved and kept at reset value. Refer to .</description>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>TEACK</name>
            <description>Transmit enable acknowledge flag
This bit is set/reset by hardware, when the Transmit Enable value is taken into account by the USART.
It can be used when an idle frame request is generated by writing TEÂ =Â 0, followed by TEÂ =Â 1 in the USART_CR1 register, in order to respect the TEÂ =Â 0 minimum period.</description>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>REACK</name>
            <description>Receive enable acknowledge flag
This bit is set/reset by hardware, when the Receive Enable value is taken into account by the USART.
It can be used to verify that the USART is ready for reception before entering low-power mode.
Note: If the USART does not support the wakeup from Stop feature, this bit is reserved and kept at reset value. Refer to .</description>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
          </field>
          <field>
            <name>TXFE</name>
            <description>TXFIFO empty
